blog/2017/08/gpg-key-transition/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-07-06 Thu 05:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>GPG Key Transition</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="kb" />
<meta name="description" content="Key transition statement and verification steps"
 />
<meta charset="utf-8">

<meta name="author" content="Kenny Ballou">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

<title>~kb</title>

<link rel="canonical" href="/" />
<link href="/index.xml" rel="alternate" type="application/rss+xml"
      title="~kb/blog" />

<link rel="stylesheet" href="/css/simple.css" />
<link rel="stylesheet" href="/css/simple.add.css" />
<link rel="stylesheet" href="/css/katex.css" />
<link rel="stylesheet" href="/css/fa-all.css" />
<link rel="shortcut icon" href="/favicon.ico" type="image/x-icon" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://kennyballou.com/blog"> UP </a>
 |
 <a accesskey="H" href="https://kennyballou.com/"> HOME </a>
</div><header id="" class="status">
<nav>
  <a href="/">
    <i class="fade fas fa-home"></i>
  </a>
  <a href="/about.html">
    <i class="fade fas fa-user-circle"></i>
  </a>
  <a href="https://git.sr.ht/~kennyballou/"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fas fa-code-branch fa-1x"></i>
  </a>
  <a href="https://github.com/kennyballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-github fa-1x"></i>
  </a>
  <a href="https://bitbucket.org/kballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-bitbucket fa-1x"></i>
  </a>
  <a href="https://linkedin.com/in/kennyballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-linkedin-in fa-1x"></i>
  </a>
  <a href="/support.html">
    <i class="fade fas fa-heart fa-1x"></i>
  </a>
  <a href="/resume.pdf"
     target="_blank">
    <i class="fade far fa-file-pdf"></i>
  </a>
  <a href="/B74CC4B41148C3DB364BC21182D94B35744E1B34.asc"
     target="_blank">
    <i class="fade fas fa-key"></i>
  </a>
  <a href="/index.xml" rel="alternate"
     type="application/rss+xml">
    <i class="fade fas fa-rss fa-1x"></i>
  </a>
</nav>
</header>
<div id="main">
<h1 class="title">GPG Key Transition</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#key-verification">Key Verification</a></li>
<li><a href="#new-gpg-setup">New GPG Setup</a>
<ul>
<li><a href="#key-generation-and-storage">Key Generation and Storage</a></li>
<li><a href="#multiple-identities">Multiple Identities</a></li>
<li><a href="#backups">Backups</a></li>
<li><a href="#future-work">Future Work</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class="PREVIEW">
<p>
Today I'm announcing my <a href="https://gnupg.org/">GPG</a> transition from my old, and now expired, <a href="https://gnupg.org/">GPG</a> key:
<a href="https://pgp.mit.edu/pks/lookup?op=get&amp;search=0x1066BA71A5F56C58">DAEE96513758BF6337F71E491066BA71A5F56C58</a> and
<a href="https://pgp.mit.edu/pks/lookup?op=get&amp;search=0x1CFA8A9CD949D956">8FCAF4F0CBB0BB9C590C8ED11CFA8A9CD949D956</a> to a new master key
<a href="https://pgp.mit.edu/pks/lookup?op=get&amp;search=0xB0CAA28A02958308">932F3E8E1C0F4A9895D7B8B8B0CAA28A02958308</a>.  The old key will remain vaild for a
little while longer, but I prefer all future correspondence to be addressed to
my new key.
</p>

</div>

<p>
This transition document is signed by all three keys to validate the
transition.
</p>

<p>
If you have signed my old key, I would appreciate new signatures on my new key
as well, provided that your signing policy permits that without
re-authenticating me.
</p>

<div id="outline-container-org4343209" class="outline-2">
<h2 id="key-verification">Key Verification</h2>
<div class="outline-text-2" id="text-key-verification">
<p>
Specifically, the old keys were:
</p>

<pre class="example">
pub   rsa4096 2014-06-12 [expired: 2017-06-27]
DAEE 9651 3758 BF63 37F7 1E49 1066 BA71 A5F5 6C58
</pre>

<p>
and,
</p>

<pre class="example">
pub   rsa4096 2015-01-30 [expires: 2018-01-30]
8FCA F4F0 CBB0 BB9C 590C 8ED1 1CFA 8A9C D949 D956
</pre>

<p>
The new key is:
</p>

<pre class="example">
pub   rsa4096 2017-06-27 [expires: 2022-06-26]
932F 3E8E 1C0F 4A98 95D7 B8B8 B0CA A28A 0295 8308
</pre>

<p>
To fetch my new key from a key server, use the following:
</p>

<pre class="example">
gpg --keyserver pool.sks-keyservers.net --recv-key 0xB0CAA28A02958308
</pre>

<p>
Or, if you prefer, you may also download the new key from
<a href="https://kennyballou.com/kballou.pub.asc">this blog</a>:
</p>

<pre class="example">
curl -fsL https://kennyballou.com/kballou.asc -O
</pre>

<p>
The new key can be verified with the old key:
</p>

<pre class="example">
gpg --check-sigs 0xB0CAA28A02958308
</pre>

<p>
If you do not have the old key, or would like to double check, the fingerprint
can be verified against the one above:
</p>

<pre class="example">
gpg --fingerprint 0xB0CAA28A02958308
</pre>

<p>
If you have all of the keys, <a href="https://kennyballou.com/blog/2017/08/gpg-key-transition/gpg-transition.org.asc">this document</a> can be
verified to be signed by all keys:
</p>

<pre class="example">
gpg --verify gpg-transition.org.asc
</pre>

<p>
If you are satisfied that you have the correct key and the UID's match, and if
it's compatible with your key signing policy, I would greatly appreciate it if
you would sign my key:
</p>

<pre class="example">
gpg --sign-key 0xB0CAA28A02958308
</pre>

<p>
Finally, if you could upload these signatures, I would appreciate it.  You can
either upload the signatures to a public key server directly:
</p>

<pre class="example">
gpg --keyserver pool.sks-keyservers.net \
    --send-key 0xB0CAA28A02958308
</pre>

<p>
Or you can send me an email with the new signatures:
</p>

<pre class="example">
gpg --armor --export 0xB0CAA28A02958308
</pre>
</div>
</div>

<div id="outline-container-org3fdac5d" class="outline-2">
<h2 id="new-gpg-setup">New GPG Setup</h2>
<div class="outline-text-2" id="text-new-gpg-setup">
<p>
The new key/transition is brought about by a number of months of thinking about
<a href="https://gnupg.org/">GPG</a> and a set of small problems I've been facing with
<a href="https://gnupg.org/">GPG</a>.  Mainly, sharing keys between the number of different computers
I use through the day makes me sad and worrisome.  Similarly, there isn't a
good backup/recovery solution to the previous setup, something the transition
aims to fix.  Finally, multiple keys per identity was more bothersome than I
had originally anticipated.
</p>

<p>
My knowledge of <a href="https://gnupg.org/">GPG</a> was young and it was time to level up my
knowledge.  To that end, I will, briefly, describe how my current setup works.
</p>
</div>

<div id="outline-container-org0131821" class="outline-3">
<h3 id="key-generation-and-storage">Key Generation and Storage</h3>
<div class="outline-text-3" id="text-key-generation-and-storage">
<p>
This new setup follows the basic "master-key with sub-keys" approach.  I have
an encrypted USB drive (several, actually), that contains the master key and
the sub keys.  The master key is used for signing and self-certification, but
has no other purpose.  The sub keys are created for the other purposes, e.g.,
encryption, signing, and authentication.  I will not go over the specifics of
generating the keys or creating this setup, there are
<a href="https://www.chameth.com/2016/08/11/offline-gnupg-master-yubikey-subkeys/">many</a>
<a href="https://www.void.gr/kargig/blog/2013/12/02/creating-a-new-gpg-key-with-subkeys/">guides</a> <a href="https://gist.github.com/abeluck/3383449">already</a> for that
purpose.
</p>

<p>
To solve the multiple device problem, I purchased a <a href="https://www.yubico.com/products/yubikey-hardware/yubikey-neo/">Yubikey Neo</a>
to contain the sub keys.  I'm currently, as of this writing, only using the
<a href="https://en.wikipedia.org/wiki/Smart_card">smartcard</a> functionality of the Yubikey, thus, I cannot
speak to its other uses.  However, something to note, the current Yubikey
(series 4) cannot hold keys bigger than 3072 bits, thus, all of my sub keys are
2048 bits.  This turns out to be an acceptable trade off, as 2048 keys are
really, really similar in strength to 4096 keys.  I don't have enough
cryptographic knowledge to sink into the Elliptic-Curve based key algorithms,
but they seem to show great strengths against the larger RSA algorithm without
as many weaknesses.
</p>
</div>
</div>

<div id="outline-container-orgf2535f0" class="outline-3">
<h3 id="multiple-identities">Multiple Identities</h3>
<div class="outline-text-3" id="text-multiple-identities">
<p>
<a href="https://gnupg.org/">GPG</a> keys can have multiple UID's associated with them, eliminating
the need for a mapping of keys to email addresses, (unless of course, a key not
associated with your identity is desired).  However, I took a bit of a
pragmatic approach here: I did not want "work" keys tightly integrated with my
own identity.  It will be likely I will still generate a separate key for work
related activities.  This way, deleting passwords and other secrets is as
simple as deleting the key, I do not actually have to worry about the
possibility of still being able to decrypt the passwords and encrypted data.
</p>

<p>
The one drawback to this approach of having a separate key pair for personal
and work related activities is that it either necessitates <i>another</i>
<a href="https://www.yubico.com/products/yubikey-hardware/yubikey-neo/">Yubikey</a>, or I'm back to where I was with the previous setup and
the multi-device headaches that are associated with it.  However, I feel this
is acceptable, because <i>usually</i> I only have one "work" device, but multiple
personal devices.
</p>
</div>
</div>

<div id="outline-container-org21a298e" class="outline-3">
<h3 id="backups">Backups</h3>
<div class="outline-text-3" id="text-backups">
<p>
I've created numerous copies of the encrypted USB drive, and they will be
scattered to a number of locations, to make sure that I can still access at
least <i>a</i> copy of the keys, it might not be the most up to date key, but it
will get me started in getting back online.
</p>

<p>
Furthermore, because flash memory isn't perfect, I've also created a number of
printouts using <a href="http://www.jabberwocky.com/software/paperkey/">paperkey</a> such that I can recover the key even if
<i>all</i> of the USB keys fail.
</p>
</div>
</div>

<div id="outline-container-org2c0e53d" class="outline-3">
<h3 id="future-work">Future Work</h3>
<div class="outline-text-3" id="text-future-work">
<p>
One aspect of the system I would like to improve at some point is that instead
of creating exact duplicates of the flash drives or the <a href="http://www.jabberwocky.com/software/paperkey/">paperkey</a>
printouts, I would like to be able to create \(n\) by \(m\) chunks of the key
data.  That is, create a backup of \(n\) pieces that only require \(m\) copies
to be recoverable.
</p>
</div>
</div>
</div>
</div>
<footer id="" class="status">
<footer>
  <p>&copy; 2014-2023 Kenny Ballou.
    <a href="http://creativecommons.org/licenses/by-nc-sa/4.0/">Some rights
      reserved.</a></p>
  <p>Powered by <a href="https://gnu.org">GNU/Linux</a></p>
</footer>
</footer>
</body>
</html>
